# План обучения
1. Добавить базу данных Postgre, MySQL, SQLite, удаленную базу данных в облаке, Redis, Mongodb

- 1.1 Развернуть на VPS Ubuntu

- 1.2 Развернуть на VPS через docker

- 1.3 Настроить CI/CD c тестированием

- Применить механизм генерации тестовых данных

2. Настроить связи между таблицами. Минимум 5

3. В репозитории проекта описать UML

4. В архитектуру проекта добавить интерфейсы

5. На VPS применить домен и SSL сертификат

6. Применить задачи RabbitMQ

7. Применить кеширование Redis

8. Подключить новый API к проекту

9. Фронт React, Angular, Vue

10. Сделать микросервисную архитектуру

11. Применить Kubernetes

12. Тестирование API

13. Автоматизированное тестирование Selenium

14. Написание ручных тестов UI

15. Подключить клиент WPF

16. Подключить мобильный клиент 
